app/controllers/trips_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "samkessaram@gmail.com"]]
INSERT INTO "trips" ("start_latitude", "start_longitude", "end_latitude", "end_longitude", "trip_name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
  	@user = User.find_by(email:params[:email])

  	@trip = Trip.new(start_latitude: params[:start_lat], start_longitude: params[:start_long],
  		end_latitude: params[:end_lat], end_longitude: params[:end_long], trip_name: params[:trip_name], user_id:@user.id)

  	if @trip.save

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "samkessaram@gmail.com"]]
SELECT "trips".* FROM "trips" WHERE "trips"."user_id" = $1  [["user_id", 1]]
---
  def show
   	@user = User.find_by(email:params[:email])
  	response = {}

  	@trips = Trip.where(user_id:@user.id)

DELETE FROM "trips" WHERE "trips"."id" = $1  [["id", 6]]
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", 6]]
---
  def destroy
  	Trip.find(params[:id]).destroy