app/controllers/users_controller.rb

	def index
		if params[:token]
			token = params[:token]
			@user = User.find_by(token: token)
---
SELECT  "users".* FROM "users" WHERE "users"."token" = $1 LIMIT 1  [["token", "21116f7370bfa501b68af10b57094343"]]

  def create
  	@user = User.new(first_name:params[:first_name], last_name:params[:last_name], email:params[:email], password:params[:password], password_confirmation:params[:password_confirmation])
  	if @user.save
  		token = SecureRandom.hex
			response = {username: @user.first_name + " " + @user.last_name, email: @user.email, token: token}
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "samkessaram@gmail.com"]]